"use client";
import React, { useState } from "react";
import { useGetYogdans } from "@/hooks/query/yogdan.query";
import PageLoadingUI from "@/components/PageLoadingUI";
import YogdanGrid from "../YogdanGrid";
import { dictionary } from "../../dictionary";

const filteredData = [
  {
    name: "John Doe",
    description:
      "प्राचीन नेपालमा राजनीतिक योगदान एक महत्वपूर्ण भूमिका खेलेको थियो। यस योगदानले नेपाली समाज र संस्कृतिक विकासमा महत्त्वपूर्ण योगदान प्रदान गरेको थियो। प्राचीन कालमा नेपालमा विभिन्न राजा, महाराजा, शाही र राजाको परंपरागत प्रणाली थियो। यी राजाहरूले नेपाली समाजको आर्थिक, सांस्कृतिक, र राजनीतिक विकासमा महत्त्वपूर्ण भूमिका निभाएका थिए। प्राचीन नेपालमा राजनीतिक संस्कृति धेरै विविधतामा थियो। त्यस युगमा राजाहरूले समाजको प्रत्येक वर्गलाई न्याय, समानता, र स्वतन्त्रता प्रदान गर्ने कोशिश गरेका थिए। त्यसैले, राजनीतिक योगदानले समाजमा एकता, सहयोग, र संस्कृतिक समृद्धिमा महत्त्वपूर्ण भूमिका खेलेको थियो। गुप्तवंश, मल्लवंश, र शाह वंशका शासकहरूले नेपालको राजनीतिक र सांस्कृतिक इतिहासलाई समृद्ध बनाएका थिए। यी राजाहरूले नेपालमा न्याय, समानता, र धर्मिक सामूहिकतामा संरक्षण गरेका थिए। त्यसैले, तिनीहरूको राजनीतिक योगदानले नेपाली समाज र संस्कृतिक विकासमा महत्त्वपूर्ण योगदान प्रदान गरेको थियो। गुप्तवंशका राजाहरूले पहाडी राज्यमा शासन गर्ने अवस्था निर्माण गरेका थिए र उनीहरूले प्राचीन नेपालको राजनीतिक एवं सांस्कृतिक विकासमा महत्त्वपूर्ण योगदान प्रदान गरेका थिए। मल्ल वंशका राजाहरूले पनि प्राचीन नेपालको राजनीतिक र सांस्कृतिक विकासमा महत्त्वपूर्ण य",
    image: { secure_url: "/dummy/boy.jpg" },
    type: "Engineer",
    birthPlace: "New York, USA",
    status: "Active",
  },
  {
    name: "Jane Smith",
    description:
      "प्राचीन नेपालमा राजनीतिक योगदान एक महत्वपूर्ण भूमिका खेलेको थियो। यस योगदानले नेपाली समाज र संस्कृतिक विकासमा महत्त्वपूर्ण योगदान प्रदान गरेको थियो। प्राचीन कालमा नेपालमा विभिन्न राजा, महाराजा, शाही र राजाको परंपरागत प्रणाली थियो। यी राजाहरूले नेपाली समाजको आर्थिक, सांस्कृतिक, र राजनीतिक विकासमा महत्त्वपूर्ण भूमिका निभाएका थिए। प्राचीन नेपालमा राजनीतिक संस्कृति धेरै विविधतामा थियो। त्यस युगमा राजाहरूले समाजको प्रत्येक वर्गलाई न्याय, समानता, र स्वतन्त्रता प्रदान गर्ने कोशिश गरेका थिए। त्यसैले, राजनीतिक योगदानले समाजमा एकता, सहयोग, र संस्कृतिक समृद्धिमा महत्त्वपूर्ण भूमिका खेलेको थियो। गुप्तवंश, मल्लवंश, र शाह वंशका शासकहरूले नेपालको राजनीतिक र सांस्कृतिक इतिहासलाई समृद्ध बनाएका थिए। यी राजाहरूले नेपालमा न्याय, समानता, र धर्मिक सामूहिकतामा संरक्षण गरेका थिए। त्यसैले, तिनीहरूको राजनीतिक योगदानले नेपाली समाज र संस्कृतिक विकासमा महत्त्वपूर्ण योगदान प्रदान गरेको थियो। गुप्तवंशका राजाहरूले पहाडी राज्यमा शासन गर्ने अवस्था निर्माण गरेका थिए र उनीहरूले प्राचीन नेपालको राजनीतिक एवं सांस्कृतिक विकासमा महत्त्वपूर्ण योगदान प्रदान गरेका थिए। मल्ल वंशका राजाहरूले पनि प्राचीन नेपालको राजनीतिक र सांस्कृतिक विकासमा महत्त्वपूर्ण य",
    image: { secure_url: "/dummy/boy.jpg" },
    type: "Scientist",
    birthPlace: "London, UK",
    status: "Active",
  },
  {
    name: "Carlos Gonzalez",
    description:
      "प्राचीन नेपालमा राजनीतिक योगदान एक महत्वपूर्ण भूमिका खेलेको थियो। यस योगदानले नेपाली समाज र संस्कृतिक विकासमा महत्त्वपूर्ण योगदान प्रदान गरेको थियो। प्राचीन कालमा नेपालमा विभिन्न राजा, महाराजा, शाही र राजाको परंपरागत प्रणाली थियो। यी राजाहरूले नेपाली समाजको आर्थिक, सांस्कृतिक, र राजनीतिक विकासमा महत्त्वपूर्ण भूमिका निभाएका थिए। प्राचीन नेपालमा राजनीतिक संस्कृति धेरै विविधतामा थियो। त्यस युगमा राजाहरूले समाजको प्रत्येक वर्गलाई न्याय, समानता, र स्वतन्त्रता प्रदान गर्ने कोशिश गरेका थिए। त्यसैले, राजनीतिक योगदानले समाजमा एकता, सहयोग, र संस्कृतिक समृद्धिमा महत्त्वपूर्ण भूमिका खेलेको थियो। गुप्तवंश, मल्लवंश, र शाह वंशका शासकहरूले नेपालको राजनीतिक र सांस्कृतिक इतिहासलाई समृद्ध बनाएका थिए। यी राजाहरूले नेपालमा न्याय, समानता, र धर्मिक सामूहिकतामा संरक्षण गरेका थिए। त्यसैले, तिनीहरूको राजनीतिक योगदानले नेपाली समाज र संस्कृतिक विकासमा महत्त्वपूर्ण योगदान प्रदान गरेको थियो। गुप्तवंशका राजाहरूले पहाडी राज्यमा शासन गर्ने अवस्था निर्माण गरेका थिए र उनीहरूले प्राचीन नेपालको राजनीतिक एवं सांस्कृतिक विकासमा महत्त्वपूर्ण योगदान प्रदान गरेका थिए। मल्ल वंशका राजाहरूले पनि प्राचीन नेपालको राजनीतिक र सांस्कृतिक विकासमा महत्त्वपूर्ण य",
    image: { secure_url: "/dummy/boy.jpg" },
    type: "Manager",
    birthPlace: "Madrid, Spain",
    status: "Inactive",
  },
  {
    name: "Aiko Tanaka",
    description:
      "प्राचीन नेपालमा राजनीतिक योगदान एक महत्वपूर्ण भूमिका खेलेको थियो। यस योगदानले नेपाली समाज र संस्कृतिक विकासमा महत्त्वपूर्ण योगदान प्रदान गरेको थियो। प्राचीन कालमा नेपालमा विभिन्न राजा, महाराजा, शाही र राजाको परंपरागत प्रणाली थियो। यी राजाहरूले नेपाली समाजको आर्थिक, सांस्कृतिक, र राजनीतिक विकासमा महत्त्वपूर्ण भूमिका निभाएका थिए। प्राचीन नेपालमा राजनीतिक संस्कृति धेरै विविधतामा थियो। त्यस युगमा राजाहरूले समाजको प्रत्येक वर्गलाई न्याय, समानता, र स्वतन्त्रता प्रदान गर्ने कोशिश गरेका थिए। त्यसैले, राजनीतिक योगदानले समाजमा एकता, सहयोग, र संस्कृतिक समृद्धिमा महत्त्वपूर्ण भूमिका खेलेको थियो। गुप्तवंश, मल्लवंश, र शाह वंशका शासकहरूले नेपालको राजनीतिक र सांस्कृतिक इतिहासलाई समृद्ध बनाएका थिए। यी राजाहरूले नेपालमा न्याय, समानता, र धर्मिक सामूहिकतामा संरक्षण गरेका थिए। त्यसैले, तिनीहरूको राजनीतिक योगदानले नेपाली समाज र संस्कृतिक विकासमा महत्त्वपूर्ण योगदान प्रदान गरेको थियो। गुप्तवंशका राजाहरूले पहाडी राज्यमा शासन गर्ने अवस्था निर्माण गरेका थिए र उनीहरूले प्राचीन नेपालको राजनीतिक एवं सांस्कृतिक विकासमा महत्त्वपूर्ण योगदान प्रदान गरेका थिए। मल्ल वंशका राजाहरूले पनि प्राचीन नेपालको राजनीतिक र सांस्कृतिक विकासमा महत्त्वपूर्ण य",
    image: { secure_url: "/dummy/boy.jpg" },
    type: "Designer",
    birthPlace: "Tokyo, Japan",
    status: "Active",
  },
  {
    name: "Liam O'Connor",
    description:
      "प्राचीन नेपालमा राजनीतिक योगदान एक महत्वपूर्ण भूमिका खेलेको थियो। यस योगदानले नेपाली समाज र संस्कृतिक विकासमा महत्त्वपूर्ण योगदान प्रदान गरेको थियो। प्राचीन कालमा नेपालमा विभिन्न राजा, महाराजा, शाही र राजाको परंपरागत प्रणाली थियो। यी राजाहरूले नेपाली समाजको आर्थिक, सांस्कृतिक, र राजनीतिक विकासमा महत्त्वपूर्ण भूमिका निभाएका थिए। प्राचीन नेपालमा राजनीतिक संस्कृति धेरै विविधतामा थियो। त्यस युगमा राजाहरूले समाजको प्रत्येक वर्गलाई न्याय, समानता, र स्वतन्त्रता प्रदान गर्ने कोशिश गरेका थिए। त्यसैले, राजनीतिक योगदानले समाजमा एकता, सहयोग, र संस्कृतिक समृद्धिमा महत्त्वपूर्ण भूमिका खेलेको थियो। गुप्तवंश, मल्लवंश, र शाह वंशका शासकहरूले नेपालको राजनीतिक र सांस्कृतिक इतिहासलाई समृद्ध बनाएका थिए। यी राजाहरूले नेपालमा न्याय, समानता, र धर्मिक सामूहिकतामा संरक्षण गरेका थिए। त्यसैले, तिनीहरूको राजनीतिक योगदानले नेपाली समाज र संस्कृतिक विकासमा महत्त्वपूर्ण योगदान प्रदान गरेको थियो। गुप्तवंशका राजाहरूले पहाडी राज्यमा शासन गर्ने अवस्था निर्माण गरेका थिए र उनीहरूले प्राचीन नेपालको राजनीतिक एवं सांस्कृतिक विकासमा महत्त्वपूर्ण योगदान प्रदान गरेका थिए। मल्ल वंशका राजाहरूले पनि प्राचीन नेपालको राजनीतिक र सांस्कृतिक विकासमा महत्त्वपूर्ण य",
    image: { secure_url: "/dummy/boy.jpg" },
    type: "Executive",
    birthPlace: "Dublin, Ireland",
    status: "Active",
  },
];

const page = () => {
  const { data, isLoading } = useGetYogdans();
  const [query, setParams] = useState({
    name: "",
    type: "",
  });

  if (isLoading) return <PageLoadingUI />;

  return <YogdanGrid data={data} />;
};

export default page;
