import React from "react";
import Image from "next/image";

// kendraya samiti
// province
// bidhes samiti
// paramarsha
// sallakar

const page = () => {
  return (
    <div>
      <h1 className="text-4xl font-semibold text-center py-10">
        संस्थाको परिचय
      </h1>
      <div className="space-y-10 px-2 pb-10 md:pb-20 max-w-7xl mx-auto">
        <Image
          src="/about/hero.svg"
          alt="heroimg"
          className="h-[400px] w-full object-cover object-center rounded-3xl border shadow-xl"
          height={0}
          width={500}
        />
        <div>
          <p className="text-md md:pl-4 md:pr-8 text-justify mx-auto">
            नेपाल: प्राकृतिक सौन्दर्य र सांस्कृतिक सम्पदाको धनी भूमि हिमालयको
            काखमा रहेको नेपाल, आफ्नो मनमोहक भू-परिदृश्य, विविध संस्कृति, र
            ऐतिहासिक महत्वको लागि प्रख्यात देश हो। चीनसँग उत्तरमा र भारतसँग
            दक्षिण, पूर्व, र पश्चिममा सीमाना जोडिएको यो स्थलाकृत देशले प्राकृतिक
            सौन्दर्य र सांस्कृतिक सम्पदाको अनौठो सम्मिश्रण प्रदान गर्दछ, जसले
            पर्यटक र विद्वानहरू दुवैलाई आकर्षित गर्छ।
            <br />
            <br />
            भौगोलिक र प्राकृतिक आश्चर्यहरू नेपालको भूगोलिक संरचना अत्यन्त विविध
            छ। यहाँ संसारको सर्वोच्च शिखर सगरमाथा (एभरेस्ट) देखि सुरु गरेर
            विभिन्न हिमशृंखलाहरू, हरियाली वनहरू, र उर्वर तराईका मैदानहरू छन्।
            हिमालको उच्च भागमा शीतल जलवायु पाइन्छ भने तराईमा उष्ण कटिबन्धीय
            जलवायु पाइन्छ। नेपालमा विश्वकै उच्च शिखरहरू मध्ये आठवटा रहेका छन्,
            जसले पर्वतारोहण र पदयात्रा गर्नेहरूको लागि स्वर्गीय अनुभव प्रदान
            गर्छ। सांस्कृतिक र धार्मिक विविधता नेपालको सांस्कृतिक विविधता पनि
            उत्तिकै प्रशंसनीय छ। यहाँ विभिन्न जाति, भाषा, र धर्मका मानिसहरूको
            बसोबास छ। हिन्दू धर्म र बौद्ध धर्मका प्रमुख तीर्थस्थलहरू नेपालमा
            अवस्थित छन्, जसले धार्मिक सहिष्णुता र विविधतालाई प्रतिविम्बित गर्छ।
            <br />
            <br />
            पशुपतिनाथ, स्वयंभूनाथ, र लुम्बिनी जस्ता धार्मिक स्थलहरूले धार्मिक
            पर्यटकहरूको मन आकर्षित गर्छ। ऐतिहासिक र पुरातात्त्विक महत्व नेपालको
            इतिहास पनि उतिक्कै रोमाञ्चक छ। लिच्छवि, मल्ल, र शाह वंशको शासनकालले
            नेपाललाई ऐतिहासिक र सांस्कृतिक दृष्टिले समृद्ध बनाएको छ। काठमाडौं
            उपत्यकामा रहेको तीन प्रमुख शहर – काठमाडौं, भक्तपुर, र पाटन – मा
            रहेको पुरातात्त्विक सम्पदाहरूले नेपाललाई सम्पदा पर्यटनको केन्द्र
            बनाएको छ। जनजीवन र सामाजिक संरचना नेपालको ग्रामीण क्षेत्रहरूको
            जीवनशैली सरल र परम्परागत छ, जहाँ कृषि मुख्य पेशा हो। शहरहरूमा
            आधुनिकता र परम्पराको मिश्रण देख्न पाइन्छ। नेपाली समाजमा पारिवारिक र
            सामाजिक सम्बन्धहरूलाई ठूलो महत्त्व दिइन्छ, जसले यहाँको आत्मीयता र
            आतिथ्यलाई झल्काउँछ। पर्यटन र अर्थतन्त्र पर्यटन नेपालको प्रमुख आर्थिक
            क्षेत्र हो। हरेक वर्ष लाखौं पर्यटकहरू नेपालमा पर्वतारोहण, पदयात्रा,
            <br />
            <br />र धार्मिक पर्यटनको लागि आउने गर्छन्। साथै, कृषि, जलविद्युत, र
            रेमिट्यान्स पनि नेपालको अर्थतन्त्रका प्रमुख आधारहरू हुन्। निष्कर्ष
            नेपाल प्राकृतिक सौन्दर्य र सांस्कृतिक सम्पदाको धनी देश हो। यहाँको
            विविधता, सौन्दर्य, र आत्मीयताले हरेक आगन्तुकलाई मोहित पार्छ। नेपाल
            मात्र भूगोलिक रूपमा उचाइमा छैन, यहाँका मानवीय मूल्य र संस्कारहरूले
            पनि यसलाई उच्च स्थानमा राखेको छ। नेपाल एक यस्तो भूमि हो, जहाँ
            प्रकृति र संस्कृति हातेमालो गर्दै अगाडि बढिरहेका छन्।
          </p>
        </div>
      </div>
    </div>
  );
};

export default page;
