"use client";
import PageLoadingUI from "@/components/PageLoadingUI";
import { useGetSingleLiterature } from "@/hooks/query/literatures.query";
import { Calendar, Pencil } from "lucide-react";
import { useParams } from "next/navigation";
import React from "react";

export default function Page() {
  const { id } = useParams();
  console.log("single Literature id: ", id);
  // const { data, isLoading } = useGetSingleLiterature(
  //   id
  // );
  // if (isLoading) return <PageLoadingUI />;
  return (
    <div className="2xl:container mx-auto px-2 sm:px-8 py-16">
      <h1 className="text-center text-3xl max-w-3xl mx-auto font-semibold pb-10">
        परिवारको गाथा, एउटा बुनिएको लुगा, गहिरोमा बसेको नेपालको मनमा, धरतीमा,
        इतिहासका कथाहरू विस्तारमा, छायाँ गर्दछ जाति र
      </h1>

      <div className="max-w-3xl mx-auto flex items-center justify-between">
        <div className="flex gap-2">
          <Calendar size={20} />
          बैशाख १ , २०८०
        </div>
        <div className="flex items-center gap-4 justify-center">
          <img
            src="/avatar.jpg"
            className="rounded-full border"
            width={50}
            alt=""
          />
          <div>
            <Pencil size={20} />
            इतिहासका कथाहरू
          </div>
        </div>
      </div>

      <p className="leading-relaxed max-w-3xl mx-auto text-justify mt-10">
        नेपालको मनमा, धरतीमा, इतिहासका कथाहरू विस्तारमा, छायाँ गर्दछ जाति र
        परिवारको गाथा, एउटा बुनिएको लुगा, गहिरोमा बसेको। युगोंको सिरानोमा,
        जातिले राज्य गर्यो स्वायत्त, जीवनलाई आफ्नो रूपमा आकार दियो, तारारोपमा
        समयको चक्कर पर्खे, नयाँ कथाहरू आउँछन्, नयाँ सत्यहरू खुल्छन्। पहाड़बाट
        तराईसम्म, उत्तरदेखि दक्षिणसम्म, जातिको प्रभाव फैलिएको छ चारो तिर, तर
        उसको छायामा, उसको नजरमा, परिवर्तनको आत्मा छ, सूर्यको ब्यान्डमा। क्योंकि
        नेपालको इतिहासको गहिरो भित्र, समृद्धताको खोजी, न्यायको निर्देशन। जातीय
        विविधतामा, एकतामा सहारा पाइ, हरेक आत्मा, चाहे जाति भए वा नभए, मिल्छ एकता
        मा आत्म-विश्वास, मिल्छ शक्ति जब भए । त्यसैले हाम्रो अत्ती, पुरानो
        गलियोमा, तालाबारी, भविष्यको खोजी, नयाँ श्रृंगार नै पाइ, किनकि नेपालको
        कथा, जातिले छायामा छ, तर एकतामा हाम्रो भविष्य रहेछ पनि यहाँ।
        <br />
        नेपालको मनमा, धरतीमा, इतिहासका कथाहरू विस्तारमा, छायाँ गर्दछ जाति र
        परिवारको गाथा, एउटा बुनिएको लुगा, गहिरोमा बसेको। युगोंको सिरानोमा,
        जातिले राज्य गर्यो स्वायत्त, जीवनलाई आफ्नो रूपमा आकार दियो, तारारोपमा
        समयको चक्कर पर्खे, नयाँ कथाहरू आउँछन्, नयाँ सत्यहरू खुल्छन्। पहाड़बाट
        तराईसम्म, उत्तरदेखि दक्षिणसम्म, जातिको प्रभाव फैलिएको छ चारो तिर, तर
        उसको छायामा, उसको नजरमा, परिवर्तनको आत्मा छ, सूर्यको ब्यान्डमा। क्योंकि
        नेपालको इतिहासको गहिरो भित्र, समृद्धताको खोजी, न्यायको निर्देशन। जातीय
        विविधतामा, एकतामा सहारा पाइ, हरेक आत्मा, चाहे जाति भए वा नभए, मिल्छ एकता
        मा आत्म-विश्वास, मिल्छ शक्ति जब भए । त्यसैले हाम्रो अत्ती, पुरानो
        गलियोमा, तालाबारी, भविष्यको खोजी, नयाँ श्रृंगार नै पाइ, किनकि नेपालको
        कथा, जातिले छायामा छ, तर एकतामा हाम्रो भविष्य रहेछ पनि यहाँ।
        <br />
        नेपालको मनमा, धरतीमा, इतिहासका कथाहरू विस्तारमा, छायाँ गर्दछ जाति र
        परिवारको गाथा, एउटा बुनिएको लुगा, गहिरोमा बसेको। युगोंको सिरानोमा,
        जातिले राज्य गर्यो स्वायत्त, जीवनलाई आफ्नो रूपमा आकार दियो, तारारोपमा
        समयको चक्कर पर्खे, नयाँ कथाहरू आउँछन्, नयाँ सत्यहरू खुल्छन्। पहाड़बाट
        तराईसम्म, उत्तरदेखि दक्षिणसम्म, जातिको प्रभाव फैलिएको छ चारो तिर, तर
        उसको छायामा, उसको नजरमा, परिवर्तनको आत्मा छ, सूर्यको ब्यान्डमा। क्योंकि
        नेपालको इतिहासको गहिरो भित्र, समृद्धताको खोजी, न्यायको निर्देशन। जातीय
        विविधतामा, एकतामा सहारा पाइ, हरेक आत्मा, चाहे जाति भए वा नभए, मिल्छ एकता
        मा आत्म-विश्वास, मिल्छ शक्ति जब भए । त्यसैले हाम्रो अत्ती, पुरानो
        गलियोमा, तालाबारी, भविष्यको खोजी, नयाँ श्रृंगार नै पाइ, किनकि नेपालको
        कथा, जातिले छायामा छ, तर एकतामा हाम्रो भविष्य रहेछ पनि यहाँ।
      </p>
    </div>
  );
}
